/****************************************Copyright (c)**************************************************
**                                  vixa
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: StateCtrl.c
**创   建   人: Xsky
**创 建 日  期: 2011-06-15 10:30
**描        述: 系统运行状态定义及相关操作函数
** 版  本: v1.0.00
**------------------------------------------------------------------------------------------------------
** 相关文件: StateCtrl.h
**------------------------------------------------------------------------------------------------------
** 最后修改日期: 
** 修改人: Xsky
** 版本: v1.0.00
**-------------------------------------------------------------------------------------------------------
** 修改人: Xsky
** 日期: 
** 版本: v1.0.00
** 修改: 
**			1. 
**			2. 
**			3. 
**			4. 
**			5. 
********************************************************************************************************/

#define  STATECTRL_GLOBALS
#include "Global.h"
#include "StateCtrl.h"

t_sysState g_SysState = SYS_STATE_Init;
t_sysState g_SysStateReq = SYS_STATE_Init;


/*********************************************************************************************************
** 函数名称: SysIsReqNextState
** 功能描述: 检查当前状态与目标请求状态，若目标状态与当前状态不同，当前非错误状态，目标状态正常则返回TRUE
** 输　入: 无
** 输　出: 无
** 返　回: TRUE: 可以进入新的请求状态
**		 FALSE: 不可以进入新的请求状态
** 全局变量: g_SysState, g_SysStateReq
** 调用模块: SYS_StateRead(), SYS_StateReqRead()
** 版　本: v0.0.01
** 作　者: Xsky
** 日　期: 2011-06-15 11:12
** 备　注: 
**-------------------------------------------------------------------------------------------------------
** 版　本: 
** 修改人: 
** 日　期: 
** 描　述: 
********************************************************************************************************/
t_bool SysIsReqNextState(void)
{
	register t_sysState s0, s1;

	SYS_StateRead(s0);
	SYS_ReqStateRead(s1);
	if(s0 != s1)					/* 与当前状态不同 */
	if(s1 > SYS_STATE_Init)			/* 请求目标状态为非初始化状态 */
	if(s1 <= SYS_STATE_Top)			/* 请求目标状态为非错误状态 */
	if(s0 != SYS_STATE_Error)		/* 当前系统状态不处于错误状态 */
	{
		
		return TRUE;
	}

	return FALSE;
}


